trade_exp/src/InformationRegisters/АналогиНоменклатуры/АналогиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8fdb01f6-4967-4863-8211-300891e04633">
  <name>АналогиНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="5101c189-e0d9-4d7a-ad43-75fe9ff7c368">
    <name>Кратность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c8b16b72-9107-42cd-bc6b-e7ed0308c512">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="ed55715d-dbff-4f56-9d3f-c1366a117f76">
    <name>ОбратнаяАналогия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="56dd2c22-0fcc-4868-b308-1d6f8a56ed55">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ed23a32e-e185-4b37-b18e-204672040e54">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="8754e396-036b-4c70-867f-6bf8ed950029">
    <name>АналогНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="26f13074-bd31-45ce-8888-d525330b5e0b">
    <name>АналогХарактеристики</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/АналогиНоменклатуры/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&Вместо("ПередЗаписью")
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЭтотОбъект.Количество()=0 Тогда
		Если  Модифицированность() Тогда
			Попытка
				
				АналогНоменклатуры = ЭтотОбъект.Отбор.АналогНоменклатуры.Значение;
				Номенклатуры = ЭтотОбъект.Отбор.Номенклатура.Значение;       
				ХарактеристикаАналогНоменклатуры = ЭтотОбъект.Отбор.АналогХарактеристики.Значение;
				ХарактеристикаНоменклатуры = ЭтотОбъект.Отбор.Характеристика.Значение;
				
				НаборЗаписей = РегистрыСведений.АналогиНоменклатуры.СоздатьНаборЗаписей(); 
				НаборЗаписей.Отбор.Номенклатура.Установить(АналогНоменклатуры);
				НаборЗаписей.Отбор.Характеристика.Установить(ХарактеристикаАналогНоменклатуры);
				НаборЗаписей.Отбор.АналогНоменклатуры.Установить(Номенклатуры);
				НаборЗаписей.Отбор.АналогХарактеристики.Установить(ХарактеристикаНоменклатуры);
				НаборЗаписей.Прочитать();
				
				Для каждого ЗаписьНабора из НаборЗаписей Цикл
					Если ЗаписьНабора.ОбратнаяАналогия Тогда
						ЗаписьНабора.ОбратнаяАналогия = Ложь;
					КонецЕсли;
				КонецЦикла;
				
				НаборЗаписей.Записать(); 
				
			Исключение
				Сообщить("Ошибка:" + ОписаниеОшибки());
			КонецПопытки
			
		КонецЕсли;
	Иначе
		Для Каждого ТекЗапись Из ЭтотОбъект Цикл
			Если Не (ЗначениеЗаполнено(ТекЗапись.Номенклатура) И ЗначениеЗаполнено(ТекЗапись.АналогНоменклатуры)) Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&Вместо("ПриЗаписи")
Процедура ПриЗаписи(Отказ, Замещение)
	Для Каждого ТекЗапись Из ЭтотОбъект Цикл
		Попытка
			Если ТекЗапись.ОбратнаяАналогия Тогда
				Если Не ЕстьАналогичнаяЗапись(ТекЗапись.АналогНоменклатуры,ТекЗапись.АналогХарактеристики,ТекЗапись.Номенклатура,ТекЗапись.Характеристика) Тогда
					ОбратнаяЗапись = РегистрыСведений.АналогиНоменклатуры.СоздатьМенеджерЗаписи();
					ОбратнаяЗапись.Номенклатура = ТекЗапись.АналогНоменклатуры;
					ОбратнаяЗапись.АналогНоменклатуры = ТекЗапись.Номенклатура;
					ОбратнаяЗапись.Характеристика = ТекЗапись.АналогХарактеристики;
					ОбратнаяЗапись.АналогХарактеристики = ТекЗапись.Характеристика;
					ОбратнаяЗапись.Кратность = ?(ТекЗапись.Кратность <> 0,Окр(1/ТекЗапись.Кратность,1,РежимОкругления.Окр15как20),0);
					ОбратнаяЗапись.ОбратнаяАналогия = Истина;
					ОбратнаяЗапись.Записать();
				КонецЕсли;
			Иначе
				Если ЕстьАналогичнаяЗапись(ТекЗапись.АналогНоменклатуры,ТекЗапись.АналогХарактеристики,ТекЗапись.Номенклатура,ТекЗапись.Характеристика) Тогда
					НаборЗаписей = РегистрыСведений.АналогиНоменклатуры.СоздатьНаборЗаписей(); 
					НаборЗаписей.Отбор.Номенклатура.Установить(ТекЗапись.АналогНоменклатуры);
					НаборЗаписей.Отбор.Характеристика.Установить(ТекЗапись.АналогХарактеристики);
					НаборЗаписей.Отбор.АналогНоменклатуры.Установить(ТекЗапись.Номенклатура);
					НаборЗаписей.Отбор.АналогХарактеристики.Установить(ТекЗапись.Характеристика);
					НаборЗаписей.Записать();
				КонецЕсли;
			КонецЕсли;
		Исключение
			Сообщить("Ошибка:" + ОписаниеОшибки());
		КонецПопытки
	КонецЦикла;
КонецПроцедуры

Функция ЕстьАналогичнаяЗапись(АналогНоменклатуры,АналогХарактеристики,Номенклатура,Характеристика)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АналогиНоменклатуры.Номенклатура КАК Номенклатура,
		|	АналогиНоменклатуры.Характеристика КАК Характеристика,
		|	АналогиНоменклатуры.АналогНоменклатуры КАК АналогНоменклатуры,
		|	АналогиНоменклатуры.АналогХарактеристики КАК АналогХарактеристики,
		|	АналогиНоменклатуры.Кратность КАК Кратность,
		|	АналогиНоменклатуры.Приоритет КАК Приоритет,
		|	АналогиНоменклатуры.ОбратнаяАналогия КАК ОбратнаяАналогия
		|ИЗ
		|	РегистрСведений.АналогиНоменклатуры КАК АналогиНоменклатуры
		|ГДЕ
		|	АналогиНоменклатуры.Номенклатура = &АналогНоменклатуры
		|	И АналогиНоменклатуры.Характеристика = &АналогХарактеристики
		|	И АналогиНоменклатуры.АналогНоменклатуры = &Номенклатура
		|	И АналогиНоменклатуры.АналогХарактеристики = &Характеристика";
	
	Запрос.УстановитьПараметр("АналогНоменклатуры", АналогНоменклатуры);
	Запрос.УстановитьПараметр("АналогХарактеристики", АналогХарактеристики);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

    Возврат ?(ВыборкаДетальныеЗаписи.Количество() = 0, Ложь, Истина);
КонецФункции

#КонецЕсли
